{"data":{"site":{"siteMetadata":{"title":"Ashish Dubey's Blog","author":"Ashish Dubey"}},"markdownRemark":{"id":"7b651321-b165-5f68-a840-83e3e667219c","excerpt":"Earlier this month I got the opportunity to attend QCon in London. This was my first time at QCon, which was also the first of its kind of conferences for me…","html":"<p>Earlier this month I got the opportunity to attend QCon in London. This was my first time at QCon, which was also the first of its kind of conferences for me. Most of the conferences I’ve attended before were community driven conferences like PyCon, RootConf, etc. Because I’ve always been to these conferences where people usually talk about open source software and not always processes or tools used for running the business at big companies, I was expecting less fun but was curious at the same time.</p>\n<p>Several tracks at the conference were around reliability and observability of large scale systems. Covering these subjects definitely holds importance at a conference intended for experienced engineers rather than hackers straight out of school and as a young engineer attending QCon for the first time, I could absolutely feel the difference. At Grofers, as we grow in business and team size, we face problems around running software on a larger scale. Engineering teams like us, working to help business grow, are constantly challenged to ship fast and often. Lot of people who were at QCon have either started facing these problems in recent times or have already solved these problems in their settings. From that perspective, it was good to hear from others facing similar problems and how they solved them. One of the major themes talked about at the conference was observability of software, as a practice of building reliable production systems. There was a big heap of one line sofware wisdom nuggets that I encountered at the conference, but I can easily pick one out. One that was thrown out by <a href=\"https://twitter.com/mipsytipsy\">Charity Majors</a> -</p>\n<blockquote>\n<p><em>Nines don’t matter if users aren’t happy</em></p>\n</blockquote>\n<p>It kind of highlights how the ability to design systems which are easily debuggable in production takes a backseat, when all infrastructure and reliablity efforts are driven by the uptime of services. There are a few things that we’ve been trying, or aspiring to do as an engineering team at Grofers to achieve that ability, so it was great to talk to several people and exchanging thoughts.</p>\n<p>While it was my first time at a conference like QCon, it was also my first time volunteering at a large conference. I’ve organized local meetups and a small city level conference before, so I was expecting way too much work, and probably less time for being able to actually grasp the content at the conference. However, everything was so well co-ordinated, thanks to the QCon staff and the volunteers who turned up in a decent number, that all volunteers got their fair share of the conference. They could attend talks which they were interested in, connect with the speakers, sponsors and other attendees and really be able to take away learnings from the conference like anyone else present there. Not to forget that volunteering seems to be a great way to contribute to a conference if you’re not an organizer or speaker. You are always involved and on the move, and because of that you also get a chance to interact with way more people than a normal attendee can (also, for free!). All of this made my first experience of volunteering really fulfilling and has got me excited for any other volunteering opportunities that I may get in future.</p>","frontmatter":{"title":"Being a volunteer at QCon","date":"March 25, 2018"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2018/03/25/qcon-volunteer.html","previous":{"fields":{"slug":"/2018/01/28/web-core-dumps.html"},"frontmatter":{"title":"Core dumps for debugging web apps"}},"next":{"fields":{"slug":"/2018/04/01/webaudio-viz-webusb.html"},"frontmatter":{"title":"Web of audio visualization devices"}}}}