{"data":{"site":{"siteMetadata":{"title":"Ashish Dubey's Blog","author":"Ashish Dubey"}},"markdownRemark":{"id":"5bb00ca3-7a97-5d17-9864-1b4a9cd8abce","excerpt":"I feel pretty bad for not having written about my Google Summer of Code project that I’m undertaking this summer for Wikimedia Foundation for prototyping…","html":"<p>I feel pretty bad for not having written about my Google Summer of Code project that I’m undertaking this summer for Wikimedia Foundation for prototyping collaborative editing feature for the new under-development VisualEditor(wysiwyg). Its been a while since I was selected, and started working on it, so I won’t go into discussing the story around how I got started on it. But, I would like to discuss about the present state of the project, where its heading and also a bare working demo of the code produced so far.</p>\n<p>So the VisualEditor project is a wysiwyg editor for MediaWiki, designed from scratch keeping in mind the complexities of the Wikitext mapping to HTML and data structures suitable for inline editing. The changes to the text in VisualEditor are in the form of transactions. There are transactions for insertion/deletion of text as well as applying formatting attributes to a portion of text.\nSo most of the collaboration thing revolves around these transactions. There is a collaboration server which listens for new connections from clients who requests to initiate an editing session. A client module establishes connection with the server, and listens to the changes made in the document and translates the resulting transactions to the server. A thing that should be noted here is, the project is under Phase 1 which would support only one client who publishes changes to the server’s document and other connected clients simply listen to these changes and apply them in their local documents. Phase 2 would support multiple publishers which would bring in conflicts and concurrency issues and perhaps measures to fight with them.</p>\n<p>So, there is a small list of things which have been done so far -</p>\n<h2>On the Server</h2>\n<ol>\n<li>Listen to new connections and define I/O events.</li>\n<li>Bind the VE modules into a single module which is imported as a top-level <code class=\"language-text\">ve</code> object.</li>\n<li>Create a new user session on every new connection and associate with the requested document.</li>\n<li>Create a new document model instance if an editing session is initiated on a new document.</li>\n<li>Apply incoming transactions to the document model.</li>\n<li>Invoke/revoke publishing rights on user sessions.</li>\n</ol>\n<h2>On the Client</h2>\n<ol>\n<li>Initialize a new session with the server on manual request.</li>\n<li>Enable/Disable editing based on publishing right flag received from the server.</li>\n<li>Listen to document change events and push transactions to the server if publishing is given.</li>\n<li>Apply incoming transaction from the server if the origin of the transaction is a different client.</li>\n<li>Retain the document state before collaborative editing is turned on so it can be restored when collaborative mode is turned off.</li>\n</ol>\n<h2>Brief Internals</h2>\n<p>The collaboration server is a Node.js based server, which uses socket.io for making persistent connections with the clients for realtime communication. The client module binds against the server’s API which is laid in terms of the socket.io events defined in the server. All the VE functionality is accessed through a binding module which exports a top-level <code class=\"language-text\">ve</code> object much like the <code class=\"language-text\">ve</code> namespace is used on the client-side. The server can parse the wiki pages internally using the parser modules and also can fetch the parsed HTML output from an external parsoid service over HTTP. As of now, an external parsoid service is used for scalability until something better can be figured out.</p>\n<h2>What Should be Coming?</h2>\n<ol>\n<li>\n<p>Authentication</p>\n<blockquote>\n<p>Some code has been written for handling user authentication on the socket connections level but is not functional right now. Also, due some review on the proper technique to do it, its deferred for a little later.</p>\n</blockquote>\n</li>\n<li>\n<p>Editing control transfer</p>\n<blockquote>\n<p>Right now editing control is given to any user who joins when there is no client with publishing right is connected to the server on a same document. A publishing user before disconnecting might want to transfer the editing control to a client which is already connected as non-publishing client.</p>\n</blockquote>\n</li>\n<li>\n<p>Transactions buffering</p>\n<blockquote>\n<p>Right now every transaction is fired towards the server as it is generated in the VisualEditor. This would be quite a network activity. So, there would be some buffering and capping of the transactions before they are transported to the server.</p>\n</blockquote>\n</li>\n</ol>\n<h2>About the Demo</h2>\n<ol>\n<li>Updated fork of <code class=\"language-text\">realtimeve</code> branch of VisualEditor.</li>\n<li>Runs the collaboration server alongside the parsoid service in the same master process but on a different port. The collaboration server uses this parsoid service to fetch parsed HTML over HTTP.</li>\n<li>The client UI lets users to turn-on/off the collaborative editing mode.</li>\n<li>The user with the editing control is shown in green in the users list displayed on the right.</li>\n</ol>\n<p><a href=\"http://ashishdubey.info/mw/index.php\"><strong>Link to the demo site</strong></a></p>\n<h3>Less Important (Fancy) Information</h3>\n<p>The demo is hosted on an Amazon EC2 micro instance, running Ubuntu 11.10. The server uses Node.js v0.8.1 and socket.io v0.9.6. The cluster module used in running the parsoid service forks five workers while running the collaboration server on the master process.</p>\n<h2>Reporting issues</h2>\n<p>If you’ve got suggestion to improve a feature, or about a new feature or you want to report some bugs, you can get in touch with me directly through my email - ashish[dot]dubey91[at]gmail[dot]com.</p>","frontmatter":{"title":"Collaborative VisualEditor: First Demo","date":"July 05, 2012"}}},"pageContext":{"slug":"/realtimeve-first-demo/","previous":{"fields":{"slug":"/opensource-wowness/"},"frontmatter":{"title":"Open source Wowness"}},"next":{"fields":{"slug":"/crunch-in-network/"},"frontmatter":{"title":"Putting Some Crunch in the Network"}}}}