{"data":{"site":{"siteMetadata":{"title":"Ashish Dubey's Blog","author":"Ashish Dubey"}},"markdownRemark":{"id":"4b4ec482-31d0-5211-b854-226a49be5ada","excerpt":"I just attended a boot-camp for extension development for Firefox, and got to say that Firefox is lot cooler than I ever thought. The boot-camp was organized by…","html":"<p>I just attended a boot-camp for extension development for Firefox, and got to say that Firefox is lot cooler than I ever thought. The boot-camp was organized by a group of open source developers in my college that comprised of the seniors from 2nd and 3rd year. It was all good, I enjoyed learning all the stuff related to extension development especially the new language XUL which is used to design extensions. One of the days included brainstorming of project ideas that we could implement our knowledge on. I had an idea of a social bookmarking/sharing plugin, so I thought I could give it a try. I trolled over and coded the extension throughout the night adding functionality to publish content on Facebook, StumbleUpon, Digg, and Twitter. The next day as the bootcamp concluded, I published my extension over the Mozilla’s add-on website. It can be found <a href=\"https://addons.mozilla.org/en-US/firefox/addon/socialize-extension-for-fir\">here</a>. If you use Firefox, I would be glad if you download it and give it a try and ofcourse comments and feedback is always welcome.</p>\n<p><a href=\"http://opensource.jiitu.org/wiki/index.php?title=Socialize_Extension_for_Mozilla_Firefox\">Wiki page</a></p>\n<p><a href=\"http://code.google.com/p/socialize-addon-firefox\">Google Project Hosting</a></p>","frontmatter":{"title":"Socialize extension for Firefox","date":"April 18, 2011"}}},"pageContext":{"slug":"/2011/04/18/socialize-ff-extension/","previous":{"fields":{"slug":"/2010/12/07/html-interpreter/"},"frontmatter":{"title":"The HTML Interpreter project"}},"next":{"fields":{"slug":"/2011/05/05/eclipse-cpp-setup/"},"frontmatter":{"title":"Setting up Eclipse as your C/C++ environment"}}}}