{"data":{"site":{"siteMetadata":{"title":"Ashish Dubey's Blog","author":"Ashish Dubey"}},"markdownRemark":{"id":"8841e936-0aaa-5811-a488-bd968491d012","excerpt":"This is one of the awfully long-time overdue posts I’ve had in my mind, but have not been able to make it on this space. But since its never too late, I’m…","html":"<p><em>This is one of the awfully long-time overdue posts I’ve had in my mind, but have not been able to make it on this space. But since its never too late, I’m writing about the cool project I was working on while interning at Mozilla during the summer of 2013.</em></p>\n<h2>About Marketplace</h2>\n<p><a href=\"https://marketplace.firefox.com\">Firefox Marketplace</a>, for the uninitiated is the platform where developers can host their Firefox apps which run on desktop and mobile (of course including Firefox OS). It acts as the central repository of apps, from where users can download and install apps on their systems. And by that I don’t mean a plain repository of apps which just allows you to download apps, but also essentials like compatibility checks, app analytics, ratings, reviews, etc. Just like <a href=\"https://addons.mozilla.org\">Firefox Add-ons</a>, there are apps for various kinds of users on Marketplace. Since Mozilla cares much about the quality of the apps served to its users, it makes sure that the apps meet a quality standard before they are available on the Marketplace. For this purpose, there is process of App Review which comes after a new app is submitted to Firefox Marketplace and before it is available to the users for download. App reviewers, which include paid staff and volunteers, take a close look at the submitted apps, beyond just the description of it. It includes inspecting the app’s functionality, performance, and security. If the reviewers like it, it goes live for the users to download, if not, the developer (who submits the app) is notified about the issues found during the review, and the developer is expected to fix those before it can be reviewed again and made public.</p>\n<h2>About the Problem</h2>\n<p>So, in the Marketplace workflow, we have three kinds of users namely, developers, reviewers and users (Firefox users who download the apps). The review process is basically hidden from the users as it is not relevant to them. Its the developers and reviewers which interact with each other during the review process mainly for feedback, reporting issues and asking questions. The Reviewer Tools provides a dashboard for the reviewers to review apps, which allows them to pick apps they want to review, and take actions on the apps they are reviewing (that is reject, make public, delete or ask for more information). On the other hand, Developer Hub is the dashboard for the developers, which they can manage apps (that is upload an app, edit uploaded apps). Though, this is an efficient workflow for both developers and reviewers, but on the communication front they are a bit disconnected. Every time, a reviewer takes an action on an app, its developer is notified about the action and the enclosed comments in an email. If the developer has any question or comment on the action, they reply back to the email which is delivered to a mailing list which has all the reviewers as its members. While the process works and is transparent, its not the best experience for both developers and especially reviewers. There is no central place in Marketplace where users can view all their conversation. It is totally tied up with their email. Also, communication on mailing lists gets messy after a while, reviewers have to keep track of developers’ email addresses, among other hassles. So my project for the summer was to revamp this process in the following ways:</p>\n<ol>\n<li>\n<p>Create a dashboard for both reviewers and developers to access their present and past conversations. This should be used to read and reply to the messages exchanged between the users.</p>\n</li>\n<li>\n<p>Bridge the email conversation and dashboard, so that the users can use both modes of communication as they please.</p>\n</li>\n</ol>\n<h2>About the Solution</h2>\n<p>This is what a part of solution looked like:</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/56b71cb147afc4990eb059c0ecaa27a2/cac6d/commbadgescreen.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 51.54998258446535%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAKCAYAAAC0VX7mAAAACXBIWXMAAAsTAAALEwEAmpwYAAABYklEQVQoz32Sy07DMBBF8/9/UjZsu2CB2HQBVIIKiVYVUIUmaRwntvOw86CXsduUpBQsXdnOeI7vTOwJISBVDh74+FjM8RmECLZbZFkGG/tPUkqkaTo66zHGwJIEcRQi9DcIowgBQXcsAU8zcIolZ+Kc08xhc+M4dnMvz97ipJRzarTG1WSC29kDIi7QNg3OR1mWyPMcSh1yVc8geZfKeFr7eA8YiqpG03Touv1Idd2iqgwBlTs/zD85FEIegQrPmwThNoKhJK07AuxPMuYLbQtqRwLff6UeJi6nNzMAHh3SrfN1gLfVElnMHNBCbOU91K7LUlMv2Qn0C+g+HgOmaiFFQWtFZdEL4Bn9SUHrwu3z3PawcM6GsIsO7eHp3TXul8+QhSZ3mvpVORljnIrCQsewP0u2N08fbzBbLSAyiUtD00s4OBy7OwP+BF98hXQXI085uanJXTNQ6/pa0Qs4h1l9A4qT+Z5QLF7XAAAAAElFTkSuQmCC'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Dashboard Screenshot\"\n        title=\"\"\n        src=\"/static/56b71cb147afc4990eb059c0ecaa27a2/fb8a0/commbadgescreen.png\"\n        srcset=\"/static/56b71cb147afc4990eb059c0ecaa27a2/1a291/commbadgescreen.png 148w,\n/static/56b71cb147afc4990eb059c0ecaa27a2/2bc4a/commbadgescreen.png 295w,\n/static/56b71cb147afc4990eb059c0ecaa27a2/fb8a0/commbadgescreen.png 590w,\n/static/56b71cb147afc4990eb059c0ecaa27a2/526de/commbadgescreen.png 885w,\n/static/56b71cb147afc4990eb059c0ecaa27a2/fa2eb/commbadgescreen.png 1180w,\n/static/56b71cb147afc4990eb059c0ecaa27a2/08f6a/commbadgescreen.png 1770w,\n/static/56b71cb147afc4990eb059c0ecaa27a2/cac6d/commbadgescreen.png 2871w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>This is the communication dashboard frontend which is written over the same codebase that the Firefox Marketplace is based on, that is <a href=\"https://github.com/mozilla/fireplace\">fireplace</a>, which is essentially a homegrown client-side framework with Marketplace specific bits like how the requests are dispatched, responses are cached, and rendered. Later, most of the Marketplacey commonware was abstracted out and <a href=\"https://github.com/mozilla/commonplace\">commonplace</a> was born, which served as the base for all other Marketplace related projects, including communication dashboard frontend, source code of which resides in <a href=\"https://github.com/mozilla/commbadge\">commbadge</a>.</p>\n<h2>More About the Solution</h2>\n<p>A little about the frontend was described above, but that was only a part of the entire thing. The frontend is basically a client-side app which talks to the Marketplace REST API, for reading/writing communication dashboard data. This is actually how Firefox Marketplace works. The frontend is a client-side app which fetches data from the Marketplace API and renders it using <a href=\"http://jlongster.github.io/nunjucks\">Nunjucks</a> templating library. The Marketplace API codebase is written in Python/Django (codename <a href=\"https://github.com/mozilla/zamboni\">zamboni</a>), and is huge and might require an additional blog post to get into the details. For the purpose of this post, lets just stick to the details of Marketplace API relevant to the communication dashboard API.</p>\n<p>The REST API is written using the <a href=\"http://django-rest-framework.org\">Django REST Framework</a>, which makes it really easy and quick for writing new API endpoints, once you understand how it works. Since, I had worked on Tastypie before, it took me a while to understand different parts of DRF work together, but spending time reading the documentation and codebase itself, yielded good results. I realized that DRF is infact, very simple and flexible framework, making it really easy to control different parts of an API request lifecycle in DRF, simply by extending different classes that DRF provides. I’ve actually used DRF for another personal project of mine, and it helped setup an API in no time.</p>\n<p>One requirement of the project, is to be able to handle the incoming email replies. This means that, a reply to a message sent from communication dashboard can be sent over email and the replies should be tied to the same conversation thread. This is done by sending an email for every message that is sent from the communication dashboard, to the recipients of the message through email. A unique reply token is embedded in the <em>Reply-To</em> address of each email, which internally corresponds to a single conversation thread. Whenever a reply is sent to the reply address, the email server pipes the email to the communication dashboard API, which in background then extracts this reply token and figures out which thread it belongs to and creates its record in the database. Works pretty neatly.</p>\n<h2>About the Result</h2>\n<p>Much of the prototyping was done by the time I was done with my internship, but the project could not get deployed, which kept me from addressing the real issues it might face in production. But it was a fun ride. It was challenging to find edge cases, and dozen of issues which would arise in every single bug that was part of the project.</p>\n<p>My project presentation can be viewed at <a href=\"https://air.mozilla.org/2013-intern-dubey\">air.mozilla.org/2013-intern-dubey</a>, slides of which are available <a href=\"http://slid.es/ashishdubey/internpresentation13\">here</a>.</p>\n<p>In a nutshell, I had an awesome summer!</p>\n<h2>Thanks</h2>\n<p>The awesome summer would not be possible and much fun without my supervisor <a href=\"https://twitter.com/cvanw\">cvan</a>. Learnt so much from him and <a href=\"https://twitter.com/mattbasta\">Matt Basta</a> while working on commbadge, commonplace and zamboni, having fun code reviews. <a href=\"https://twitter.com/clouserw\">Wil Clouser</a> and the entire Marketplace team for a place in the awesome team.</p>\n<p>Special thanks to <a href=\"http://ngokevin.com\">Kevin Ngo</a> for taking forward the work on communication dashboard, making it awesome and suck less.</p>","frontmatter":{"title":"Communication Dashboard in Firefox Marketplace","date":"March 22, 2014"}}},"pageContext":{"slug":"/mozilla-summer/","previous":{"fields":{"slug":"/crunch-in-network/"},"frontmatter":{"title":"Putting Some Crunch in the Network"}},"next":{"fields":{"slug":"/browserstack-infantry/"},"frontmatter":{"title":"JS, Browsers in Cloud and Parallel Indexing"}}}}